
while True:
    print("원하시는 아이디를 입력해주세요.")
    print("아이디는 10자 내로 입력해주세요",end = ":")
    myid = input()
    if len(myid) < 10:
        print("비밀번호 설정창으로 넘어갑니다.")
        print("$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$")
        print("$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$실행중$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$")
        print("$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$")
        break
    else:
        print("아이디가 10자가 넘습니다. 다시 확인바랍니다")
    continue

while True:
    print("설정할 비밀번호를 입력하세요",end = ":")
    mypswrd = input()
    print("비밀번호를 재확인 합니다",end = "")
    mypswrd2 = input()

    if mypswrd2 == mypswrd :
        print ("일치합니다.")
        print("$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$")
        print("$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$저희 계정을 만들어 주셔서 감사합니다!$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$")
        print("$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$")
        break
    elif mypswrd2 != mypswrd:
        print("비밀번호가 일치하지 않습니다, 다시 입력해주세요")
    continue

